# _*_coding :utf-8 _*_
# @Time :2022/5/10 10:44
# @File : 052-python-爬虫介绍
# @Project : python-base

"""
一.什么是爬虫？
  答：
  解释1：如果我们将互联网比作一张大的蜘蛛网，那一台计算机上的数据就是蜘蛛网的的猎物，而爬虫程序，
  就是一只小蜘蛛，沿着蜘蛛网抓取自己想要的猎物
  解释2: 实用程序模拟浏览器，去向服务器发送请求，获取响应信息

二，爬虫核心
  答：
  1.爬取网页
  2.解析数据
  3.难点：爬虫和反爬虫的博弈

三，爬虫的用途？
  答:
  1.数据分析/人工数据
  2.社交软件冷启动
  3.舆情监控
  4.竞争对手监控

四，爬虫类型
   答：
   1.通用爬虫（不学习）
    实例：百度，360，Google

   2.聚焦爬虫（学习）
   根据需求，实现爬虫程序，抓取需要的数据

五，设计思路
  1.确定爬取的url
  2.模拟浏览器通过http协议访问url，获取html代码
  3.解析html代码，（根据需求提取想要的数据）

















"""



























