"""
python 在网络爬虫，数据分析、数据可视化，机械学习，web开发的主要 第三方库
    网络爬虫：

    BeautifulSoup：一个用于解析 HTML 和 XML 文档的库。
    Scrapy：一个基于 Python 的爬虫框架，用于快速开发高效、可维护的网络爬虫。

    数据分析：

        NumPy：一个用于科学计算的库，包含强大的多维数组对象和函数。
        Pandas：一个用于数据操作和分析的库，支持数据读取、清洗、筛选、变换等多种操作。
        Matplotlib：一个用于绘制图表的库，支持多种图表类型。
        
    机器学习(深度学习)：
        MXNet（Apache MXNet）：是一个流行的开源深度学习框架，由亚马逊、华为和多伦多大学等机构共同开发和维护。
        Scikit-learn：一个用于机器学习的库，包含多种算法和工具，支持分类、回归、聚类等多种任务。
        TensorFlow：一个用于机器学习和深度学习的库，支持构建神经网络、进行数据流图计算等功能。
        pytorch：

    数据可视化：

        Seaborn：一个基于 Matplotlib 的库，提供更美观、更易用的数据可视化界面。
        Plotly：一个交互式数据可视化库，支持多种图表类型和用户交互功能。

    Web 开发：
        Pyramid：一个流行的Python Web框架，它是一个轻量级的、灵活的、可扩展的框架，可用于构建各种Web应用程序和服务
        Flask：一个轻量级 Web 应用框架，适用于快速构建小型 Web 应用。
        Django：一个用于 Web 开发的全栈框架，包含多种组件和工具，支持快速构建大型 Web 应用。
    
    用户界面:
        wxpython、PyQt5、pygtk



"""